[
  {
    "id": 1,
    "name": "MarBenz",
    "type": "Website",
    "image": "/marbenz-webdesign.webp",
    "description": "Eine Portfolio-Webseite, um meine Projekte und Fähigkeiten zu präsentieren.\n\nDie Webseite wurde mit Vite und React erstellt.\n\nDas Design wurde mit TailwindCSS umgesetzt.\n\nDie Webseite ist responsiv und wurde mit dem Ziel erstellt, dass sie auf allen Geräten gut aussieht.",
    "badges": ["Vite", "React", "Tailwind"],
    "github": "https://github.com/marbenz2/portfolio-marbenz/",
    "live": "https://marbenz.de/"
  },
  {
    "id": 2,
    "name": "Blockinfo",
    "type": "Web App",
    "image": "/blockinfo.webp",
    "description": "Ein kleines Dashboard mit Informationen über die VeChain Thor Blockchain.\n\nVerwendet wurde die VeChainStats-API, um die neuesten Informationen zu Nodes, Blöcken und Transaktionen zu erhalten.\n\nDie Coingecko-API wird genutzt, um die neuesten Preisinformationen zu erhalten.\n\nEine Datenbank wird verwendet, um historische Transaktionsdaten zu speichern.\n\nSchließlich werden die Transaktionsdaten der letzten 12 Monate in einem Graphen dargestellt.",
    "badges": ["Next", "Tailwind", "shadcn/ui", "MongoDB", "GraphJS", "API"],
    "github": "https://github.com/marbenz2/blockinfo/",
    "live": "https://blockinfo-two.vercel.app/"
  },
  {
    "id": 3,
    "name": "VManager",
    "type": "Web3 App",
    "image": "/vmanager.webp",
    "description": "Ein kleines Dashboard mit Informationen über eine eingeloggte VeChain Wallet.\n\nFür die Daten der Blöcke, Transaktionen sowie der Benutzer Wallet wird VeChains eigene Connex API eingesetzt.\n\nHauptsächlich dient die App dazu, einen User via VeWorld (VeChain Wallet) einzuloggen und ihm Informationen über seine Wallet zu geben.",
    "badges": ["Vite", "Tailwind", "shadcn/ui", "Connex"],
    "github": "https://github.com/marbenz2/vmanager/",
    "live": "https://vmanager.pages.dev/"
  },
  {
    "id": 4,
    "name": "KI Wetter App",
    "type": "Web App",
    "image": "/ai-weather-app.webp",
    "description": "Die Wetter-App nutzt KI, um Wetterdaten auf innovative Weise zu präsentieren.\n\nDie Daten werden direkt von Open Meteo über GraphQL bezogen, während die KI-Funktionalität durch OpenAI's GPT-3.5 über RapidAPI bereitgestellt wird.\n\nDas Design der App wurde mit TailwindCSS realisiert und mit besonderem Augenmerk auf Responsivität gestaltet, um auf allen Geräten eine optimale Darstellung zu gewährleisten.\n\nDie Entwicklung dieser App basiert auf einem YouTube-Tutorial von",
    "badges": [
      "Next",
      "Tailwind",
      "Tremor",
      "OpenAI",
      "StepZen",
      "GraphQL",
      "RapidAPI"
    ],
    "github": "https://github.com/marbenz2/ai-weather-app/",
    "live": "https://ai-weather-app-seven.vercel.app/",
    "reference": {
      "link": "https://www.youtube.com/@SonnySangha/",
      "name": "@SonnySangha"
    }
  }
]
